In [6]:
import pandas as pd
import numpy as np
df = pd.read_csv('C:/Users/Admin/OneDrive/Desktop/data/nyc_taxi_2019-07.csv', header=0, usecols=['passenger_count','total_amount','payment_type'])
df.head()

   passenger_count  payment_type  total_amount
0                1             1          4.94
1                1             2         20.30
2                1             1         70.67
3                1             1         66.36
4                0             1         15.30

In [7]:
df.fillna(0, inplace=True)
df

         passenger_count  payment_type  total_amount
0                      1             1          4.94
1                      1             2         20.30
2                      1             1         70.67
3                      1             1         66.36
4                      0             1         15.30
...                  ...           ...           ...
1954913                1             1         13.57
1954914                1             1         15.35
1954915                1             1         17.30
1954916                1             1         15.35
1954917                1             1          0.00

[1954918 rows x 3 columns]

In [8]:
df['year'] = 2019
df.head()

   passenger_count  payment_type  total_amount  year
0                1             1          4.94  2019
1                1             2         20.30  2019
2                1             1         70.67  2019
3                1             1         66.36  2019
4                0             1         15.30  2019

In [10]:
import pandas as pd
import numpy as np
df1 = pd.read_csv('C:/Users/Admin/OneDrive/Documents/GitHub/Programmation2/data/nyc_taxi_2020-07.csv', header=0, usecols=['passenger_count','total_amount','payment_type'])
df1.head()

   passenger_count  payment_type  total_amount
0              1.0           2.0          9.30
1              1.0           1.0         27.80
2              1.0           2.0         22.30
3              1.0           1.0         14.16
4              1.0           2.0          7.80

In [11]:
df1.fillna(0, inplace=True)
df1

        passenger_count  payment_type  total_amount
0                   1.0           2.0          9.30
1                   1.0           1.0         27.80
2                   1.0           2.0         22.30
3                   1.0           1.0         14.16
4                   1.0           2.0          7.80
...                 ...           ...           ...
800407              0.0           0.0         83.50
800408              0.0           0.0         19.78
800409              0.0           0.0         38.45
800410              0.0           0.0         29.77
800411              0.0           0.0         51.90

[800412 rows x 3 columns]

In [51]:
df1['year'] = 2020
df1

        passenger_count  payment_type  total_amount  year
0                   1.0           2.0          9.30  2020
1                   1.0           1.0         27.80  2020
2                   1.0           2.0         22.30  2020
3                   1.0           1.0         14.16  2020
4                   1.0           2.0          7.80  2020
...                 ...           ...           ...   ...
800407              0.0           0.0         83.50  2020
800408              0.0           0.0         19.78  2020
800409              0.0           0.0         38.45  2020
800410              0.0           0.0         29.77  2020
800411              0.0           0.0         51.90  2020

[800412 rows x 4 columns]

In [52]:
dftotal = pd.concat([df, df1])
dftotal.head()

   passenger_count  payment_type  total_amount  year
0              1.0           1.0          4.94  2019
1              1.0           2.0         20.30  2019
2              1.0           1.0         70.67  2019
3              1.0           1.0         66.36  2019
4              0.0           1.0         15.30  2019

In [54]:
#Question 1 Trajets effectues en 2019 et 2020
dftotal.loc[dftotal['year'] ==2019, 'year'].count()

6310419

In [55]:
dftotal.loc[dftotal['year'] ==2020, 'year'].count()

800412

In [56]:
#Differences entre les valeurs 2019 et 2020
dftotal.loc[dftotal['year'] ==2019, 'year'].count() - dftotal.loc[dftotal['year'] ==2020, 'year'].count()

5510007

In [57]:
#Question 2 combien d'argent (au total) a ete collecte en 2019 et 2020?
dftotal.loc[dftotal['year'] ==2019, 'total_amount'].sum()

123761823.33000001

In [58]:
dftotal.loc[dftotal['year'] ==2020, 'total_amount'].sum()

14912844.090000005

In [59]:
#Differences entre les valeurs 2019 et 2020
dftotal.loc[dftotal['year'] ==2019, 'total_amount'].sum() - dftotal.loc[dftotal['year'] ==2020, 'total_amount'].sum()

108848979.24000001

In [63]:
#Question 3 la proportion de trajets avec plus d'un passanger a ete change de maniere significative?
dftotal.loc[dftotal['passenger_count']>1, 'passenger_count'].count()

1930736

In [64]:
dftotal.loc[dftotal['passenger_count']==1, 'passenger_count'].count()

4946899

In [67]:
#Question 4 les gens ont utilise moin d'argent liquide(cest-a dire le type de paiment 2) en 2020 que en 2019?
dftotal.loc[(dftotal['payment_type'] ==2) & (dftotal['year'] ==2019),'payment_type'].count()

1801718

In [68]:
dftotal.loc[(dftotal['payment_type'] ==2) & (dftotal['year'] ==2020),'payment_type'].count()

236433